RMS/Connectors/Insert Work Order - RMS.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.service-now.com/wm_order">
<soap:Header/>
	<soap:Body>
		<inc:insert>
			<caller><![CDATA[${sn_caller}]]></caller>
			<company><![CDATA[${sn_contract}]]></company>
			<contact_type><![CDATA[${sn_contact_type}]]></contact_type>
			<correlation_id><![CDATA[${sn_correlation_id}]]></correlation_id>
			<description><![CDATA[${sn_description}]]></description>
			<expected_start><![CDATA[${sn_expected_start}]]></expected_start>
			<location><![CDATA[${sn_location}]]></location>
			<state><![CDATA[${sn_state}]]></state>
			<qualification_group><![CDATA[${sn_qualification_group}]]></qualification_group>
			<short_description><![CDATA[${sn_short_description}]]></short_description>
			<priority><![CDATA[${sn_priority}]]></priority>
			<cmdb_ci><![CDATA[${sn_cmdb_ci}]]></cmdb_ci>
			<u_category><![CDATA[${sn_category}]]></u_category>
			<u_contact_details><![CDATA[${sn_u_contact_details}]]></u_contact_details>
			<u_customer_site><![CDATA[${sn_u_customer_site}]]></u_customer_site>
			<u_work_order_type><![CDATA[${sn_u_work_order_type}]]></u_work_order_type>
			<u_problem_type><![CDATA[${sn_u_problem_type}]]></u_problem_type>
			<u_product_type><![CDATA[${sn_u_product_type}]]></u_product_type>
		</inc:insert>
	</soap:Body>
</soap:Envelope>